# 판다스(Pandas) 04 - 데이터프레임(DataFrame) 만들기

데이터프레임(DataFrame) 만들기 - from dict type

- 판다스에서는 dictionary 타입 데이터 또는 순서가 보장되어 있는 OrderedDict 타입 데이터를 DataFrame 클래스의 인자로 넘겨주면 데이터프레임(DataFrame)을 직접 만들 수 있음

In [2]:
import pandas as pd

person_dict = {'Name' : ['John', 'Sabre', 'Kim', 'Sato'], 
               'Country' : ['USA', 'France', 'Korea', 'Japan'], 
               'Age' : [31, 33, 28, 40], 
               'Job' : ['Student', 'Lawyer', 'Developer', 'Chef']}

In [3]:
df1 = pd.DataFrame(person_dict)

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef

In [6]:
df2 = pd.DataFrame(data = person_dict, columns = ['Name', 'Country', 'Age', 'Job'])

df2

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef

데이터프레임(DataFrame) 만들기 - from OrderedDict type

In [7]:
from collections import OrderedDict

ordered_persons_dict = OrderedDict([('Name', ['John', 'Sabre', 'Kim', 'Sato']), 
                                   ('Country', ['USA', 'France', 'Korea', 'Japan']),
                                   ('Age', [31, 33, 28, 40]), 
                                   ('Job', ['Student', 'Lawyer', 'Developer', 'Chef'])])

In [8]:
df1 = pd.DataFrame(ordered_persons_dict)
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef

In [9]:
# DataFrame 생성 시, index 옵션을 주면 index 값을 별도로 지정할 수 있음

df2 = pd.DataFrame(ordered_persons_dict, index = ['one', 'two', 'three', 'four'])
df2

        Name Country  Age        Job
one     John     USA   31    Student
two    Sabre  France   33     Lawyer
three    Kim   Korea   28  Developer
four    Sato   Japan   40       Chef